app/controllers/student_infos_controller.rb

SELECT "student_infos".* FROM "student_infos"
---
  def index
    @student_infos = StudentInfo.all

INSERT INTO "student_infos" ("name", "number", "major", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "张三"], ["number", 1], ["major", "计算机科学与技术"], ["email", "zhangsan@163.com"], ["created_at", "2017-11-05 08:06:45.313411"], ["updated_at", "2017-11-05 08:06:45.313411"]]
---
  def create
    @student_info = StudentInfo.new(student_info_params)

    respond_to do |format|
      if @student_info.save

DELETE FROM "student_infos" WHERE "student_infos"."id" = ?  [["id", 1]]
---
  def destroy
    @student_info.destroy

SELECT  "student_infos".* FROM "student_infos" WHERE "student_infos"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_student_info
      @student_info = StudentInfo.find(params[:id])